src/Documents/ПередачаСредствВДолг/ПередачаСредствВДолг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаСредствВДолг</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипОперацииДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Баланс/Баланс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Баланс</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счета</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Долги/Долги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Долги</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контакт</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ТипОперацииДолга/ТипОперацииДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипОперацииДолга</name>
  <enumValues>
    <name>ВыдачаДенег</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенег</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидОперацииДолга/ВидОперацииДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииДолга</name>
  <enumValues>
    <name>ДаюВДолг</name>
  </enumValues>
  <enumValues>
    <name>БеруВДолг</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПередачаСредствВДолг/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль объекта документа ПередачаСредствВДолг.
// ВидОперации — направление долга: ДаюВДолг = «Мне должны», БеруВДолг = «Я должен».
// ТипОперации — движение денег: ВыдачаДенег / ВозвратДенег.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПроверитьРеквизитыДокумента(Отказ);
	
	Если Не Отказ Тогда
		
		ПроверитьКурсВалютыОперации(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИндексСуммы = ПроверяемыеРеквизиты.Найти("Сумма");
	
	Если ИндексСуммы <> Неопределено Тогда
		
		ПроверяемыеРеквизиты.Удалить(ИндексСуммы);
		
	КонецЕсли;
	
	Если Сумма <= 0 Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Сумма должна быть больше нуля.", "Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СуммаУчета = ОбщийМодульСервер_КурсыВалют.СуммаВВалютеУчета(Сумма, Валюта, Дата);
	ВыдачаДенег = ЭтоВыдачаДенег();
	
	Движения.Баланс.Записывать = Истина;
	ДвижениеБаланс = Движения.Баланс.Добавить();
	ДвижениеБаланс.ВидДвижения = ?(ВыдачаДенег, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	ДвижениеБаланс.Период = Дата;
	ДвижениеБаланс.Валюта = Валюта;
	ДвижениеБаланс.Счета = Счет;
	ДвижениеБаланс.Сумма = СуммаУчета;
	ДвижениеБаланс.ВалютнаяСумма = Сумма;
	
	// Остаток > 0 — контакт должен мне; остаток < 0 — я должен контакту.
	Движения.Долги.Записывать = Истина;
	ДвижениеДолг = Движения.Долги.Добавить();
	ДвижениеДолг.ВидДвижения = ?(ВыдачаДенег, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
	ДвижениеДолг.Период = Дата;
	ДвижениеДолг.Валюта = Валюта;
	ДвижениеДолг.Контакт = Контакт;
	ДвижениеДолг.Сумма = СуммаУчета;
	ДвижениеДолг.ВалютнаяСумма = Сумма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоВыдачаДенег()
	
	Если ЗначениеЗаполнено(ТипОперации) Тогда
		
		Возврат ТипОперации = Перечисления.ТипОперацииДолга.ВыдачаДенег;
		
	КонецЕсли;
	
	// Совместимость со старыми документами без ТипОперации.
	Возврат ВидОперации = Перечисления.ВидОперацииДолга.ДаюВДолг;
	
КонецФункции

Процедура ПроверитьРеквизитыДокумента(Отказ)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнена дата.", "Дата");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнен тип долга.", "ВидОперации");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипОперации) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнен тип операции.", "ТипОперации");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Контакт) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнен контакт.", "Контакт");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Счет) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнен счет.", "Счет");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Не заполнена валюта.", "Валюта");
		
	КонецЕсли;
	
	Если Сумма <= 0 Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения("Сумма должна быть больше нуля.", "Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКурсВалютыОперации(Отказ)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если Валюта = ВалютаУчета Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ОбщийМодульСервер_КурсыВалют.ПолучитьДанныеКурса(Валюта, Дата) = Неопределено Тогда
		
		Отказ = Истина;
		СообщитьОшибкуЗаполнения(ОбщийМодульСервер_КурсыВалют.ТекстСообщенияОбОтсутствииКурса(Валюта, Дата), "Валюта");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьОшибкуЗаполнения(ТекстСообщения, ИмяПоля)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле = ИмяПоля;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
